---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUColorByObject
source: html/17d91351-e43b-b7ca-7ed0-b115fd207da1.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUColorByObject Property

The property labeled "Color By Object" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".